Repository: GNOME/sysprof
Catalog: po/*.po
Languages: be, ja, kk, sr@latin

source: _About Sysprof
be: _Пра Sysprof

source: ID
be: Ідэнтыфікатар

source: Record a stack trace when <tt>malloc</tt> or similar functions are used
be: Запісвайце трасіроўку стэка пры выкарыстанні <tt>malloc</tt> або падобных функцый

source: Quit
be: Выхад
