Repository: GNOME/sysprof
Catalog: po/*.po
Languages: be, ja, kk, sr@latin

source: You must choose a local file to capture using Sysprof
be: Вы павінны выбраць лакальны файл для захопу з дапамогай Sysprof
ja: Sysprof を使用して取り込むローカルファイルを選択してください
kk: Sysprof көмегімен түсіру үшін жергілікті файлды таңдауыңыз керек
sr@latin: Morate da izaberete lokalnu datoteku za snimanje koristeći Sysprof

source: Close
be: Зачыніць
ja: 閉じる
kk: Жабу
sr@latin: Zatvori

source: Must Select Local Folder
ja: ローカルフォルダーを選択してください
kk: Жергілікті буманы таңдау керек
sr@latin: Morate izabrati lokalnu fasciklu

source: You must choose a local folder to add as a debug directory
ja: デバッグディレクトリーとして追加するローカルフォルダーを選択してください
kk: Жөндеу бумасы ретінде қосу үшін жергілікті буманы таңдауыңыз керек
sr@latin: Morate izabrati lokalnu fasciklu da je dodate kao dorektorijum za uklanjanje grešaka

source: Add debug directory
ja: デバッグディレクトリを追加
kk: Жөндеу бумасын қосу
sr@latin: Dodaj direktorijum za uklanjanje grešaka

source: Add _Directory
ja: ディレクトリを追加(_D)
kk: _Буманы қосу
sr@latin: Dodaj _direktorijum

source: System Capture from %s.syscap
be: Захоп сістэмы з %s.syscap
ja: %s.syscap からのシステムキャプチャ
kk: Жүйелік түсіру - %s.syscap
sr@latin: Snimanje sistema iz %s.syscap

source: Record to File
be: Запіс у файл
ja: ファイルに記録
kk: Файлға жазу
sr@latin: Snimi u datoteku

source: Record
be: Запіс
ja: 記録
kk: Жазу
sr@latin: Snimi

source: No Change
be: Няма змен
ja: 変更なし
kk: Өзгеріссіз
sr@latin: Nepromenjeno

source: Balanced
be: Сбалансаванае
ja: バランス
kk: Теңгерілген
sr@latin: Balansirano

source: Power Saver
be: Энергазберажэнне
ja: 省電力
kk: Қуатты үнемдеу
sr@latin: Ušteda energije

source: Performance
be: Прадукцыйнасць
ja: パフォーマンス
kk: Өнімділік
sr@latin: Učinkovitost

source: Sampling
be: Выбарка
ja: サンプリング
kk: Сэмплдеу
sr@latin: Uzorkovanje

source: Sample Native Stacks
be: Прыклады ўласных стэкаў
ja: ネイティブスタックをサンプリング
kk: Нативті стектерді сэмплдеу
sr@latin: Uzorkuj nativne stekove

source: Record native stack traces using a sampling profiler
be: Збіраць натыўныя стэкі выклікаў з дапамогай прафілявальніка, які працуе метадам выбарак
ja: サンプリングプロファイラーを使用してネイティブスタックトレースを記録
kk: Сэмплдеу профильдеушісі арқылы нативті стек іздерін жазу
sr@latin: Snima nativnih tragova stekova pomoću profajlera za uzorkovanje

source: Unwind Stacks in User Space
ja: ユーザー空間でのスタック展開
kk: Стектерді пайдаланушы кеңістігінде айналдыру
sr@latin: Raspetljaj stekove u korisničkom prostoru

source: Copy stack contents and registers for unwinding in user-space
ja: ユーザー空間での展開のためにスタックの内容とレジスターをコピー
kk: Пайдаланушы кеңістігінде айналдыру үшін стек мазмұнын және регистрлерді көшіру
sr@latin: Kopiraj sadržaj stekova i registruj za raspetljavanje u korisničkom prostoru

source: Stack Size
ja: スタックサイズ
kk: Стек өлшемі
sr@latin: Veličina steka

source: The number of bytes to copy from the stack
ja: スタックからコピーするバイト数
kk: Стектен көшірілетін байттар саны
sr@latin: Broj bajtova za kopiranje iz steka

source: Unwinding in user-space has considerable overhead but may help in situations where frame-pointers are unavailable.
ja: ユーザー空間でのスタック展開はかなりのオーバーヘッドがありますが、フレームポインターが利用できない場合に役立つ場合があります。
kk: Пайдаланушы кеңістігінде айналдыру едәуір қосымша шығындарға әкеледі, бірақ фрейм нұсқағыштары қолжетімсіз болған жағдайда көмектесуі мүмкін.
sr@latin: Raspetljavanje u korisničkom prostoru stvara značajno opterećenje, ali može pomoći u kada pokazivači okvira nisu dostupni.

source: Sample JavaScript Stacks
be: Прыклады стэкаў JavaScript
ja: JavaScript スタックのサンプル
kk: JavaScript стектерін сэмплдеу
sr@latin: Uzorak Java skript stekova

source: Record JavaScript stack traces using a sampling profiler
be: Запісвайце трасіроўкі стэка JavaScript з дапамогай прафілятара выбаркі
ja: サンプリングプロファイラーを使用して JavaScript スタックトレースを記録
kk: Сэмплдеу профайлері арқылы JavaScript стек іздерін жазу
sr@latin: Snima Java skript tragove steka koristiće profajler za uzorkovanje

source: Sysprof must launch your application to record JavaScript stacks using GJS.
be: Sysprof павінен запусціць ваша прыкладанне для запісу стэкаў JavaScript з дапамогай GJS.
ja: GJS を使用して JavaScript スタックを記録するには、Sysprof がアプリケーションを起動する必要があります。
kk: GJS көмегімен JavaScript стектерін жазу үшін Sysprof қолданбаңызды іске қосуы керек.
sr@latin: Sysprof mora da pokrene program za snimanje Java skript stekova koristeći GJS.

source: Record Scheduler Details
be: Падрабязнасці запіса планіроўшчыка
ja: スケジューラーの詳細を記録
kk: Жоспарлағыш мәліметтерін жазу
sr@latin: Snimi podatke zakazivača

source: Track when processes are scheduled per CPU
be: Адсочвайце, калі працэсы запланаваны на працэсар
ja: プロセスが CPU ごとにスケジュールされる時を追跡
kk: Процестердің әрбір процессор бойынша жоспарлануын бақылау
sr@latin: Prati kada su procesi zakazani na svakom procesoru

source: Tracing
be: Трасіроўка
ja: トレーシング
kk: Трассировка
sr@latin: Pratim tragove

source: Trace Memory Allocations
be: Трасіроўка размеркавання памяці
ja: メモリー割り当てをトレース
kk: Жады үлестірулерін бақылау
sr@latin: Prati alokaciju memorije

source: Record a stack trace when malloc or similar functions are used
ja: malloc や類似関数が使用される際のスタックトレースを記録
kk: malloc немесе ұқсас функциялар пайдаланылған кезде стек ізін жазу
sr@latin: Snimi tragove steka kada se koristi malloc ili slična funkcija

source: Sysprof must launch your application to record memory allocations.
be: Sysprof павінен запусціць вашу праграму для запісу размеркавання памяці.
ja: メモリー割り当てを記録するには、Sysprof がアプリケーションを起動する必要があります。
kk: Жады үлестірулерін жазу үшін Sysprof қолданбаңызды іске қосуы керек.
sr@latin: Sysprof mora da pokrene vaš program da zabeleži alokaciju memorije.

source: Application
be: Прыкладанне
ja: アプリケーション
kk: Қолданба
sr@latin: Program

source: Command Line
be: Камандны радок
ja: コマンドライン
kk: Командалық жол
sr@latin: Linija naredbi

source: Working directory
be: Працоўная дырэкторыя
ja: 作業ディレクトリ
kk: Жұмыс бумасы
sr@latin: Radni direktorijum

source: The application will be run as a subprocess of Sysprof.
be: Прыкладанне будзе запушчана як падпрацэс Sysprof.
ja: アプリケーションは Sysprof のサブプロセスとして実行されます。
kk: Қолданба Sysprof ішкі процесі ретінде орындалады.
sr@latin: Program će biti pokrenut kao podproces Sysprof-a.

source: Environment
be: Асяроддзе
ja: 環境
kk: Қоршам
sr@latin: Okruženje

source: Clear Environment
be: Ачысціць асяроддзе
ja: 環境をクリア
kk: Қоршамды тазарту
sr@latin: Očisti okruženje

source: Clear the environment before launching application
be: Ачысціць асяроддзе перад запускам прыкладання
ja: アプリケーション起動前に環境をクリア
kk: Қолданбаны іске қосу алдында қоршамды тазарту
sr@latin: Čisti okruženje pre pokretanja programa

source: Add _Variable
be: Дадаць _Пераменную
ja: 変数を追加(_V)
kk: _Айнымалыны қосу
sr@latin: Dodaj _promenljivu

source: Add Variable
be: Дадаць Пераменную
ja: 変数を追加
kk: Айнымалыны қосу
sr@latin: Dodaj promenljivu

source: _Add
be: _Дадаць
ja: 追加(_A)
kk: Қ_осу
sr@latin: _Dodaj

source: Counters
be: Лічыльнікі
ja: カウンター
kk: Есептегіштер
sr@latin: Brojači

source: CPU Usage
be: Выкарыстанне працэссара
ja: CPU 使用率
kk: Процессор қолданылуы
sr@latin: Korišćenje procesora

source: Record coarse-grained counters about CPU usage and frequency
be: Запіс падрабязных лічыльнікаў аб выкарыстанні працэсара і частаце
ja: CPU 使用率と周波数についての粗粒度カウンターを記録する
kk: Процессордың қолданылуы мен жиілігі туралы іріленген есептегіштерді жазу
sr@latin: Ugrubo snima brojače o upotrebi procesora i frekvenciji

source: Memory Usage
be: Выкарыстанне памяці
ja: メモリー使用量
kk: Жадыны қолдану
sr@latin: Upotreba memorije

source: Record coarse-grained counters about system memory usage
be: Запіс буйных лічыльнікаў аб выкарыстанні сістэмнай памяці
ja: >システムメモリー使用量についての粗粒度カウンターを記録する
kk: Жүйелік жадының қолданылуы туралы іріленген есептегіштерді жазу
sr@latin: Ugrubo snima brojače o korišćenju memorije sistema

source: Disk Usage
be: Выкарыстанне дыска
ja: ディスク使用量
kk: Дискіні қолдану
sr@latin: Korišćenje diska

source: Record coarse-grained counters about storage throughput
be: Запіс буйных лічыльнікаў аб прапускной здольнасці захоўвання
ja: ストレージスループットについての粗粒度カウンターを記録する
kk: Сақтау құрылғысының өткізу қабілеті туралы іріленген есептегіштерді жазу
sr@latin: Ugrubo snima brojače o ubacivanju u skladište

source: Network Usage
be: Выкарыстанне сеткі
ja: ネットワーク使用量
kk: Желіні қолдану
sr@latin: Korišćenje mreže

source: Record coarse-grained counters about network traffic
be: Запіс буйных лічыльнікаў сеткавага трафіку
ja: ネットワークトラフィックについての粗粒度カウンターを記録する
kk: Желілік трафик туралы іріленген есептегіштерді жазу
sr@latin: Ugrubo snimi brojače o prenosu na mreži

source: Energy Usage
be: Выкарыстанне энергіі
ja: 電力使用量
kk: Энергияны қолдану
sr@latin: Korišćenje napajanja

source: Record coarse-grained counters about energy usage in Watts
be: Запіс буйных лічыльнікаў спажывання энергіі ў ватах
ja: 電力使用量についての粗粒度カウンターをワット単位で記録する
kk: Ваттпен өлшенетін энергияны қолдану туралы іріленген есептегіштерді жазу
sr@latin: Ugrubo snimi brojače o korišćenju električne energije u vatima

source: Battery Charge
be: Зарад батарэі
ja: バッテリー残量
kk: Батарея заряды
sr@latin: Punjenje baterije

source: Record coarse-grained counters about battery charge or discharge rates
be: Запіс буйных лічыльнікаў хуткасці зарада або разрадкі батарэі
ja: バッテリーの充電および放電レートについての粗粒度カウンターを記録する
kk: Батареяның зарядталу немесе разрядталу жылдамдығы туралы іріленген есептегіштерді жазу
sr@latin: Ugrubo snimi brojače o stopi punjenja ili pražnjenja baterije

source: D-Bus
be: Шына D-Bus
sr@latin: D-magistrala

source: Record System Bus
be: Запіс Сістэмнай Шыны
ja: システムバスを記録
kk: Жүйелік шинаны жазу
sr@latin: Snimi magistrali sistema

source: Record messages on the D-Bus system bus
be: Запіс паведамленняў сістэмнай шыны
ja: D-Bus システムバスのメッセージを記録する
kk: D-Bus жүйелік шинасындағы хабарламаларды жазу
sr@latin: Sačuvaj poruke na D-magistrali sistema

source: Record Session Bus
be: Запіс Шыны Сесіі
ja: セッションバスを記録
kk: Сеанс шинасын жазу
sr@latin: Snimi magistralu sesije

source: Record messages on the D-Bus user session bus
be: Запіс паведамленняў у шыну сесіі карыстальніка D-Bus
ja: D-Bus ユーザーセッションバスのメッセージを記録する
kk: D-Bus пайдаланушы сеанс шинасындағы хабарламаларды жазу
sr@latin: Sačuvaj poruke sa D-magistrale sesije korisnika

source: The session bus may contain sensitive information such as keyboard usage and passwords.
be: Сесійная шына можа ўтрымліваць канфідэнцыяльную інфармацыю, такую як выкарыстанне клавіятуры і паролі.
ja: セッションバスにはキーボード使用やパスワードなど機密情報が含まれる可能性があります。
kk: Сеанс шинасында пернетақтаны қолдану және парольдер сияқты құпия ақпарат болуы мүмкін.
sr@latin: Magistrala sesije može da sadrži osetljive podatke kao što je upotreba tastature i lozinke.

source: Timings
be: Часавыя характарыстыкі
ja: タイミング
kk: Таймингтер
sr@latin: Trajanja

source: Compositor Frame Timings
be: Часавыя характарыстыкі кадраў кампазітара
ja: コンポジターフレームタイミング
kk: Композитор кадрларының таймингтері
sr@latin: Vremena iscrtavanja kadrova kompozitora

source: Record frame-timing information from the GNOME Shell compositor
be: Запіс інфармацыі аб часавых характарыстыках кадраў з кампазітара GNOME Shell
ja: GNOME Shell コンポジターからフレームタイミング情報を記録する
kk: GNOME Shell композиторынан кадр таймингтері туралы ақпаратты жазу
sr@latin: Snimi podatke o vremenu kadrova iz kompozitora Gnomove školjke

source: Applications launched by Sysprof will automatically collect GTK frame timing information.
be: Sysprof будзе аўтаматычна збіраць інфармацыю аб таймінгах кадраў GTK для запушчаных прыкладанняў.
ja: Sysprof によって起動されたアプリケーションは、自動的に GTK フレームタイミング情報を収集します。
kk: Sysprof іске қосқан қолданбалар GTK кадр таймингтері туралы ақпаратты автоматты түрде жинайды.
sr@latin: Programi pokrenuti preko Sysprof-a će automatski sačupiti podatke o GTK vremenima kadrova.

source: Devices
be: Прыстасаванні
ja: デバイス
kk: Құрылғылар
sr@latin: Uređaji

source: Include GPU Information
be: Уключыце інфармацыю аб GPU
ja: GPU 情報を含める
kk: GPU ақпаратын қосу
sr@latin: Uključi podatke o grafičkom procesoru

source: Records information about graphics hardware and drivers
be: Запісвае інфармацыю аб графічным абсталяванні і драйверах
ja: グラフィックハードウェアとドライバーについての情報を記録する
kk: Графикалық аппараттық қамтама және драйверлер туралы ақпаратты жазады
sr@latin: Snima podatke o harveru grafičkog procesora i njegovim upravljačkim uređajima

source: System
be: Сістэма
ja: システム
kk: Жүйе
sr@latin: Sistem

source: Power Profile
be: Профіль магутнасці
ja: 電源プロファイル
kk: Қуат профилі
sr@latin: Profil energije

source: Record with Power Profile
be: Запіс з Профілю магутнасці
ja: 電源プロファイルで記録する
kk: Қуат профилімен жазу
sr@latin: Sačuvaj sa profilom korišćenja električne energije

source: Switch to power profile while recording
be: Пераключыцеся на профіль магутнасці падчас запісу
ja: 記録中に電源プロファイルに切り替え
kk: Жазу кезінде қуат профиліне ауысу
sr@latin: Prebaci u režim uštede energije prilikom snimanja

source: Details
be: Падрабязнасці
ja: 詳細
kk: Мәліметтер
sr@latin: Detalji

source: Record System Log
be: Запіс сістэмнага журнала
ja: システムログを記録
kk: Жүйелік журналды жазу
sr@latin: Sačuvaj dnevnik sistema

source: Watch the system log for new messages and record them
be: Сачыце за новымі паведамленнямі ў сістэмным журнале і запісвайце іх
ja: システムログの新しいメッセージを監視して記録する
kk: Жүйелік журналды жаңа хабарламаларға бақылау және оларды жазу
sr@latin: Nadgledaj dnevnik sistema u potrazi za novim porukama i sačuvaj ih

source: Include Hardware Information
be: Уключыце інфармацыю аб абсталяванні
ja: ハードウェア情報を含める
kk: Аппараттық қамтама ақпаратын қосу
sr@latin: Uključi podatke o hardveru

source: Records information about PCI and USB devices
be: Запісвае інфармацыю аб прыладах PCI і USB
ja: PCI と USB デバイスについての情報を記録する
kk: PCI және USB құрылғылары туралы ақпаратты жазады
sr@latin: Čuva podatke o PCI i USB uređajima

source: Symbols
be: Сімвалы
ja: シンボル
kk: Таңбалар
sr@latin: Simboli

source: Bundle Symbols
be: Сімвалы пакета
ja: シンボルをバンドル
kk: Таңбаларды жинақтау
sr@latin: Upakuj simbole

source: Make recording shareable by symbolizing stack traces after recording
be: Зрабіце запіс даступным для сумеснага выкарыстання, сімвалізуючы сляды стэка пасля запісу
ja: 記録後にスタックトレースをシンボル化して記録を共有可能にする
kk: Жазудан кейін стек іздерін таңбалау арқылы жазбаны бөлісуге болатындай ету
sr@latin: Učini snimke deljivim simbolizovanjem tragova steka nakon snimanja

source: Enable Debuginfod to automatically fetch debug symbols
ja: Debuginfod を有効にしてデバッグシンボルを自動取得する
kk: Жөндеу таңбаларын автоматты түрде алу үшін Debuginfod іске қосу
sr@latin: Omogući Debuginfod da automatski preuzme simbole za ukanjanje grešaka

source: Debug File Directories
ja: デバッグファイルディレクトリ
kk: Жөндеу файлдарының бумалары
sr@latin: Otklanjanje grešaka u dorektorijumima datoteka

source: Directories to search for debug files
ja: デバッグファイルを検索するディレクトリ
kk: Жөндеу файлдарын іздеуге арналған бумалар
sr@latin: Direktorijumi koji su uključeni u pretragu za uklanjanje grešaka nad datotekama

source: _Open File…
be: _Адкрыць файл…
ja: ファイルを開く(_O)…
kk: Файлды _ашу…
sr@latin: _Otvori datoteku…

source: Record to _File…
be: Запіс у _File…
ja: ファイルに記録(_F)…
kk: _Файлға жазу…
sr@latin: S_nimi datoteku…

source: Record to _Memory
be: Запіс у _Памяць
ja: メモリに記録(_M)
kk: _Жадыға жазу
sr@latin: Snimi u _memoriju

source: _Keyboard Shortcuts
be: _Гарачыя кнопкі
ja: キーボードショートカット(_K)
kk: _Пернетақта жарлықтары
sr@latin: Prečice na _tastaturi

source: Help
be: Дапамога
ja: ヘルプ
kk: Көмек
sr@latin: Pomoć

source: About Sysprof
be: Пра Sysprof
ja: Sysprof について
kk: Sysprof туралы
sr@latin: O Profilatoru sistema

source: Critical
be: Крытычны
ja: 重要
kk: Критикалық
sr@latin: Kritično

source: Warning
be: Папярэджанне
ja: 警告
kk: Ескерту
sr@latin: Upozorenje

source: Debug
be: Адладачны
ja: デバッグ
kk: Жөндеу
sr@latin: Pročišćavanje

source: Info
be: Інфармацыя
ja: 情報
kk: Ақпарат
sr@latin: Podaci

source: Error
be: Памылка
ja: エラー
kk: Қате
sr@latin: Greška

source: Logs
be: Часопісы
ja: ログ
kk: Журналдар
sr@latin: Dnevnici

source: Severity
be: Узровень складанасці
ja: 重大度
kk: Маңыздылығы
sr@latin: Ozbiljnost

source: Domain
be: Дамен
ja: ドメイン
kk: Домен
sr@latin: Domen

source: Marks
be: Адзнакі
ja: マーク
kk: Белгілер
sr@latin: Oznake

source: Mark Chart
be: Пазначыць дыяграму
ja: マークチャート
kk: Белгілер диаграммасы
sr@latin: Grafikon oznaka

source: Mark Table
be: Пазначыць табліцу
ja: マークテーブル
kk: Белгілер кестесі
sr@latin: Tabela oznaka

source: Mark Waterfall
be: Пазначыць вадаспад
ja: マークウォーターフォール
kk: Белгілер сарқырамасы
sr@latin: Vodopad oznaka

source: Summary
be: Падсумаванне
ja: 概要
kk: Жиынтық
sr@latin: Izveštaj

source: Minimum
be: Мінімум
ja: 最小
kk: Минимум
sr@latin: Najmanje

source: Maximum
be: Максімум
ja: 最大
kk: Максимум
sr@latin: Najveće

source: Average
be: Сярэдне
ja: 平均
kk: Орташа
sr@latin: Prosečno

source: Median
be: Медыяна
ja: 中央値
kk: Медиана
sr@latin: Medijana

source: Set as Filter
ja: フィルターとして設定
kk: Сүзгі ретінде орнату
sr@latin: Postavi kao filter

source: Start
be: Пачаць
ja: 開始
kk: Бастау
sr@latin: Početak

source: Duration
be: Працягласць
ja: 期間
kk: Ұзақтығы
sr@latin: Trajanje

source: Process
be: Працэс
ja: プロセス
kk: Процесс
sr@latin: Proces

source: Group
be: Група
ja: グループ
kk: Топ
sr@latin: Grupa

source: Description
be: Апісанне
ja: 説明
kk: Сипаттамасы
sr@latin: Opis

source: Self
be: Я
kk: Меншікті
sr@latin: Jedna

source: Total
be: Усяго
ja: 合計
kk: Барлығы
sr@latin: Ukupno

source: Memory Allocations
be: Размеркаванне памяці
ja: メモリ割り当て
kk: Жадыны бөлу
sr@latin: Raspodela memorije

source: Stack Traces
be: Трасіроўкі стэка
ja: スタックトレース
kk: Стек іздері
sr@latin: Praćenje spremnika

source: Allocations
be: Выдзяленні
ja: 割り当て
kk: Бөлулер
sr@latin: Alokacije

source: Leaks
be: Уцечкі
ja: リーク
kk: Жылыстаулар
sr@latin: Curenja

source: Stack Trace
be: Трасіроўка стэка
ja: スタックトレース
kk: Стек ізі
sr@latin: Trag steka

source: Metadata
be: Метададзеныя
ja: メタデータ
kk: Метадеректер
sr@latin: Metapodaci

source: Key
be: Ключ
ja: キー
kk: Кілт
sr@latin: Ključ

source: Address Layout
be: Макет адрасоў
ja: アドレスレイアウト
kk: Адрестер жаймасы
sr@latin: Raspored adresa

source: Start Address
be: Пачатковы адрас
ja: 開始アドレス
kk: Бастапқы адрес
sr@latin: Početak adresa

source: End Address
be: Канчатковы адрас
ja: 終了アドレス
kk: Соңғы адрес
sr@latin: Kraj adresa

source: Mounts
be: Падключэнні
ja: マウント
kk: Тіркелген нүктелер
sr@latin: Montirano

source: Parent
be: Бацькоўскі
ja: 親
kk: Аталық
sr@latin: Roditelj

source: Major
be: Галоўны
ja: メジャー
kk: Негізгі
sr@latin: Glavni

source: Minor
be: Нязначны
ja: マイナー
kk: Қосымша
sr@latin: Sporedni

source: Mount Point
be: Кропка падключэння
ja: マウントポイント
kk: Тіркеу нүктесі
sr@latin: Tačka montiranja

source: Mount Source
be: Крыніца падключэння
ja: マウント元
kk: Тіркеу көзі
sr@latin: Izvor montiranja

source: Root
be: Каранёвы каталог
ja: ルート
kk: Түбір
sr@latin: Koren

source: Filesystem
be: Файлавая сістэма
ja: ファイルシステム
kk: Файлдық жүйе
sr@latin: Sistem datoteka

source: Threads
be: Патокі
ja: スレッド
kk: Ағындар
sr@latin: Niti

source: Thread ID
be: ID патоку
ja: スレッド ID
kk: Ағын ID
sr@latin: ID niti

source: Main Thread
be: Асноўны паток
ja: メインスレッド
kk: Негізгі ағын
sr@latin: Glavna nit

source: Processes
be: Працэсы
ja: プロセス
kk: Процестер
sr@latin: Procesi

source: Process Chart
be: Дыяграма працэсу
ja: プロセスチャート
kk: Процестер диаграммасы
sr@latin: Grafikon procesa

source: Process Table
be: Табліца працэсу
ja: プロセステーブル
kk: Процестер кестесі
sr@latin: Tabela procesa

source: %<PRIi64> events
ja: %<PRIi64> イベント
kk: %<PRIi64> оқиға
sr@latin: %<PRIi64> događaji

source: Recording Failed
be: Памылка запісу
ja: 記録できませんでした
kk: Жазу сәтсіз аяқталды
sr@latin: Snimanje nije uspelo

source: Sysprof failed to record. %s
be: Sysprof не змог запісаць. %s
ja: Sysprof で記録できませんでした。 %s
kk: Sysprof жазуды орындай алмады. %s
sr@latin: Sysprof nije uspeo da snimi. „%s“.

source: Stop Recording
be: Спыніць запіс
ja: 記録を停止
kk: Жазуды тоқтату
sr@latin: Zaustavi snimanje

source: Time Profiler
be: Аналізатар часу выканання
ja: タイムプロファイラ
kk: Уақыт профильдеушісі
sr@latin: Profiler vremena

source: Callgraph
be: Дыяграма выклікаў
ja: コールグラフ
kk: Шақырулар графы
sr@latin: Grafik poziva

source: Flamegraph
be: Дыяграма размеркавання часу выканання
ja: フレームグラフ
kk: Флеймграф
sr@latin: Vatreni grafikon

source: Clear All Filters
ja: すべてのフィルターを削除
kk: Барлық сүзгілерді тазарту
sr@latin: Očisti sve filtere

source: Seek Backward
be: Шукаць назад
ja: 後退
kk: Артқа жылжу
sr@latin: Traži unazad

source: Zoom Out
be: Аддаліць
ja: 縮小
kk: Кішірейту
sr@latin: Umanji

source: Reset Zoom
be: Скінуць павелічэнне
ja: ズームをリセット
kk: Масштабты тастау
sr@latin: Poništi uvećanje

source: Zoom In
be: Наблізіць
ja: 拡大
kk: Үлкейту
sr@latin: Uvećaj

source: Seek Forward
be: Шукаць далей
ja: 前進
kk: Алға жылжу
sr@latin: Traži unapred

source: Depth
be: Глыбіня
ja: 深さ
kk: Тереңдік
sr@latin: Dubina

source: Hits
be: Супадзенні
ja: ヒット
kk: Хиттер
sr@latin: Pogodaka

source: Open Recording
be: Адкрыць запіс
ja: 記録を開く
kk: Жазбаны ашу
sr@latin: Otvori snimanje

source: Open
be: Адкрыць
ja: 開く
kk: Ашу
sr@latin: Otvori

source: Sysprof Capture (*.syscap)
be: Захоп Sysprof (*.syscap)
ja: Sysprof キャプチャ (*.syscap)
kk: Sysprof түсірілімі (*.syscap)
sr@latin: Sysprof snimak (*.syscap)

source: Save to File
be: Захаваць у файл
ja: ファイルに保存
kk: Файлға сақтау
sr@latin: Sačuvaj u datoteku

source: Save
be: Захаваць
ja: 保存
kk: Сақтау
sr@latin: Sačuvaj

source: Loading…
be: Загрузка…
ja: 読み込み中…
kk: Жүктелуде…
sr@latin: Učitavam…

source: Invalid Document
be: Няправільны дакумент
ja: 無効なドキュメント
kk: Қате құжат
sr@latin: Neispravan dokument

source: The document could not be loaded. Please check that you have the correct capture file. %s
be: Не ўдалося загрузіць дакумент. Калі ласка, праверце, што ў вас ёсць правільны файл захопу. %s
ja: ファイルを読み込めませんでした。正しいキャプチャファイルを選択しているか確認してください。 %s
kk: Құжатты жүктеу мүмкін болмады. Түсірілім файлының дұрыс екенін тексеріңіз. %s
sr@latin: Ne mogu da učitam dokument. Proverite da li imate ispravnu datoteku snimka. %s

source: Toggle Left Panel
be: Пераключыць левую панэль
ja: 左パネルの切り替え
kk: Сол жақ панельді көрсету/жасыру
sr@latin: Prikaz leve površi

source: View Filters
ja: フィルタを表示
kk: Сүзгілерді қарау
sr@latin: Prikaži filtere

source: Main Menu
be: Галоўнае меню
ja: メインメニュー
kk: Бас мәзір
sr@latin: Glavni izbornik

source: View Options
be: Параметры прагляду
ja: オプションを表示
kk: Көрініс опциялары
sr@latin: Opcije za prikaz

source: Toggle Right Panel
be: Пераключыць правую панэль
ja: 右パネルの切り替え
kk: Оң жақ панельді көрсету/жасыру
sr@latin: Prikaz desne površi

source: Energy
be: Энергія
ja: エネルギー
kk: Энергия
sr@latin: Energija

source: Network
be: Сетка
ja: ネットワーク
kk: Желі
sr@latin: Mreža

source: Storage
be: Сховішча
ja: ストレージ
kk: Сақтау орны
sr@latin: Skladište

source: _Record Again…
be: _Запісаць яшчэ раз…
ja: 再記録(_R)…
kk: Қа_йта жазу…
sr@latin: _Ponovo snimi…

source: Open Recording…
be: Адкрыць запіс…
ja: 記録を開く…
kk: Жазбаны ашу…
sr@latin: Otvori snimak…

source: Save As…
be: Захаваць як…
ja: 名前を付けて保存…
kk: Қалай сақтау…
sr@latin: Sačuvaj kao…

source: _Quit
be: _Выхад
ja: 終了(_Q)
kk: _Шығу
sr@latin: _Izađi

source: Left Heavy
be: У асноўным злева
ja: 左優先
kk: Сол жаққа бағытталған
sr@latin: Naglašeno na levoj strani

source: IO
be: У/В
kk: Е/Ш

source: CPU
be: Працэсар
kk: Процессор

source: Toggle marks
ja: マークの切り替え
kk: Белгілер күйін ауыстыру

source: IPC
be: Міжпрацэсная камунікацыя

source: PID
be: Ідэнтыфікатар працэсу

source: Examples: # Record gtk4-widget-factory using trace-fd to get application provided # data as well as GTK and GNOME Shell data providers sysprof-cli --gtk --gnome-shell --use-trace-fd -- gtk4-widget-factory # Merge multiple syscap files into one sysprof-cli --merge a.syscap b.syscap > c.syscap
be: Прыклады: # Запішыце gtk4-widget-factory з дапамогай trace-fd, каб атрымаць прыкладанне # дадзеныя, а таксама пастаўшчыкі дадзеных GTK і GNOME Shell sysprof-cli --gtk --gnome-shell --use-trace-fd -- gtk4-widget-factory # Аб'яднанне некалькіх файлаў Syscap у адзін sysprof-cli --merge a.syscap b.syscap > c.syscap

source: _Preferences
be: _Налады

source: _Help
be: _Даведка
