Repository: GNOME/sysprof
Catalog: po/*.po
Languages: be, ja, kk, sr@latin

source: Sysprof
be: Сістэмны профіль
sr@latin: Profilator sistema

source: Profiler
be: Прафайлер
ja: プロファイラー
kk: Профильдеуші
sr@latin: Profilator

source: Profile an application or entire system.
be: Профілі прыкладання або ўсёй сістэмы.
ja: アプリケーションまたはシステム全体をプロファイルする。
kk: Қолданбаны немесе бүкіл жүйені профильдеу.
sr@latin: Profilišite neki program ili čitav sistem.

source: Start New Recording
ja: 新しい記録を開始
kk: Жаңа жазуды бастау
sr@latin: Započni novo snimanje

source: Profile an application or entire system
be: Профілі прыкладання або ўсёй сістэмы
ja: アプリケーションまたはシステム全体をプロファイルする
kk: Қолданбаны немесе бүкіл жүйені профильдеу
sr@latin: Profilišite neki program ili čitav sistem

source: Christian Hergert
sr@latin: Kristijan Hergert (Christian Hergert)

source: Sysprof allows you to profile applications to aid in debugging and optimization.
be: Сістэмны профіль дазваляе прафіляваць прыкладанні, каб дапамагчы ў адладцы і аптымізацыі.
ja: Sysprof では、デバッグと最適化を支援するためにアプリケーションをプロファイルできます。
kk: Sysprof қолданбаларды жөндеуге және оңтайландыруға көмектесу үшін оларды профильдеуге мүмкіндік береді.
sr@latin: Profilator sistema vam omogućava da profilišete programe za pomoć u pročišćavanju i optimizaciji.

source: Uncategorized
be: Без катэгорыі
ja: 未分類
kk: Санатталмаған
sr@latin: Nekategorizovano

source: Accessibility
be: Даступнасць
ja: アクセシビリティ
kk: Қолжетімділік
sr@latin: Pristupačnost

source: Actions
be: Дзеянні
ja: アクション
kk: Әрекеттер
sr@latin: Radnje

source: Crash Handler
be: Апрацоўшчык збояў
ja: クラッシュハンドラー
kk: Қателерді өңдеуіш
sr@latin: Rukovalac padom programa

source: Context Switches
be: Пераключальнікі кантэксту
ja: コンテキストスイッチ
kk: Контекст ауыстырулары
sr@latin: Zamena konteksta

source: Graphics
be: Графіка
ja: グラフィック
kk: Графика
sr@latin: Grafika

source: Icons
be: Значкі працоўнага стала
ja: アイコン
kk: Таңбашалар
sr@latin: Ikonice

source: Input
be: Увод
ja: 入力
kk: Енгізу
sr@latin: Ulaz

source: JavaScript
sr@latin: Java skript

source: Kernel
be: Ядро
ja: カーネル
kk: Ядро
sr@latin: Jezgro

source: Layout
be: Макет
ja: レイアウト
kk: Жайма
sr@latin: Raspored

source: Locking
be: Блакаванне
ja: ロック
kk: Құлыптау
sr@latin: Zaključavanje

source: Main Loop
be: Галоўная пятля
ja: メインループ
kk: Негізгі цикл
sr@latin: Glavna petlja

source: Memory
be: Памяць
ja: メモリ
kk: Жад
sr@latin: Memorija

source: Paint
be: Фарба
ja: 描画
kk: Сурет салу
sr@latin: Slikanje

source: Type System
be: Тып сістэмы
ja: 型システム
kk: Типтер жүйесі
sr@latin: Vrsta sistema

source: Unwindable
be: Неразгортваемы
ja: アンワインド可能
kk: Қалпына келтіруге болатын
sr@latin: Može se raspetljati

source: Windowing
be: Вокнавы
ja: ウィンドウ処理
kk: Терезелеу
sr@latin: Uprozoravanje

source: Downloading Symbols…
ja: シンボルをダウンロード中…
kk: Таңбаларды жүктеп алу…
sr@latin: Preuzimam simbole…

source: Allocation
be: Hазмеркаванне
ja: 割り当て
kk: Бөлу
sr@latin: Akolacija

source: Unknown Process
be: Невядомы працэс
ja: 不明なプロセス
kk: Белгісіз процесс
sr@latin: Nepoznati proces

source: Indexing capture data frames
be: Індэксацыя кадраў захопленага дадзення
ja: キャプチャデータフレームのインデックス化
kk: Түсірілген деректер фреймдерін индекстеу
sr@latin: Indeksiram okvire kadrova za snimak

source: Discovering file system mounts
be: Выяўленне падключэнняў файлавай сістэмы
ja: ファイルシステムマウントの検出
kk: Файлдық жүйенің тіркеу нүктелерін анықтау
sr@latin: Otkrivam tačke montiranja na sistemu datoteka

source: Discovering process mount namespaces
be: Выяўленне працэсных прастораў імёнаў падключэнняў
ja: プロセスマウント名前空間の検出
kk: Процестердің тіркеу аттар кеңістігін анықтау
sr@latin: Otkrivam imenske prostore procesa montiranja

source: Analyzing process address layouts
be: Аналіз мясцазнаходжанняў адрасоў працэсаў
ja: プロセスアドレス配置の解析
kk: Процесс адрестерінің жаймасын талдау
sr@latin: Analiziram rasporede adresa procesa

source: Analyzing process command line
be: Камандны радок працэсу аналіза
ja: プロセスコマンドラインの解析
kk: Процесс командалық жолын талдау
sr@latin: Analiziram komandnu liniju procesa

source: Analyzing file system overlays
be: Аналіз накладак файлавай сістэмы
ja: ファイルシステムオーバーレイの解析
kk: Файлдық жүйе қабаттарын талдау
sr@latin: Analiziram prekrivenih sistema datoteka

source: Processing counters
be: Апрацоўка лічыльнікаў
ja: カウンタの処理
kk: Есептегіштерді өңдеу
sr@latin: Obrađujem brojanje

source: Recording at %X %x
be: Запіс у %X %x
ja: %X %x で記録中
kk: Жазу уақыты: %X %x
sr@latin: Snimam u %X %x

source: Recording at %s
be: Запіс у %s
ja: %s で記録中
kk: Жазу уақыты: %s
sr@latin: Snimam u %s

source: D-Bus Message
be: Паведамленне D-Bus
ja: D-Bus メッセージ
kk: D-Bus хабарламасы
sr@latin: Poruka D-magistrale

source: Frame
be: Рамка
ja: フレーム
kk: Фрейм
sr@latin: Okvir

source: Document loaded
be: Дакумент загружаны
ja: ドキュメントが読み込まれました
kk: Құжат жүктелді
sr@latin: Dokument je učitan

source: Loading failed
be: Памылка загрузкі
ja: 読み込み失敗
kk: Жүктеу сәтсіз аяқталды
sr@latin: Učitavanje nije uspelo

source: Symbolizing stack traces
be: Сімвалізацыя стэку выклікаў
ja: スタックトレースのシンボル化
kk: Стек іздерін таңбалау
sr@latin: Simbolizacija tragova steka

source: Loading document
be: Загрузка дакумента
ja: ドキュメントを読み込み中
kk: Құжатты жүктеу
sr@latin: Učitavam dokument

source: Log
be: Журнал
ja: ログ
kk: Журнал
sr@latin: Dnevnik

source: Mark
be: Адзнака
ja: マーク
kk: Белгі
sr@latin: Oznaka

source: %s [Process %d]
be: %s [Працэс %d]
ja: %s [プロセス %d]
kk: %s [%d процесі]
sr@latin: %s [proces %d]

source: Process %d
be: Працэс %d
ja: プロセス %d
kk: %d процесі
sr@latin: Proces %d

source: Sample
be: Узор
ja: サンプル
kk: Үлгі
sr@latin: Uzorak

source: System Logs
be: Сістэмныя журналы
ja: システムログ
kk: Жүйелік журналдар
sr@latin: Sistemski dnevnik

source: Recording system logs is not supported on your platform.
be: Запіс сістэмных журналаў не падтрымліваецца на вашай платформе.
ja: お使いのプラットフォームでは、システムログの記録に対応していません。
kk: Жүйелік журналдарды жазу бұл платформада қолдау көрсетілмейді.
sr@latin: Čuvanje sistemskog dnevnika nije područano na vašoj platformi.

source: Tracer
be: Трасіроўшчык
ja: トレーサー
kk: Трейсер
sr@latin: Tragač

source: Tracing requires spawning a program compiled with ‘-finstrument-functions’. Tracing will not be available.
be: Трасіроўка патрабуе стварэння праграмы, скампіляванай з «-finstrument-functions». Трасіроўка будзе недаступная.
ja: トレースを実行するには、‘-finstrument-functions’ でコンパイルされたプログラムを起動する必要があります。トレースは利用できません。
kk: Трейсинг үшін ‘-finstrument-functions’ арқылы жинақталған бағдарламаны іске қосу керек. Трейсинг қолжетімді болмайды.
sr@latin: Praćenje zahteva pokretanje programa koji je kompajliran sa „-finstrument-functions“. Praćenje neće biti dostupno.

source: --merge requires at least 2 filename arguments
be: --merge патрабуе як мінімум 2 аргументаў імя файла
ja: --merge には少なくとも2つのファイル名引数が必要です
kk: --merge кем дегенде 2 файл аты аргументін талап етеді
sr@latin: „--merge“ zahteva barem 2 argumenta naziva datoteke

source: Disable CPU throttling while profiling [Deprecated for --power-profile]
be: Адключыць рэгуляванне ЦП падчас прафілявання [Састарэла для --power-profile]
ja: プロファイリング中にCPUスロットリングを無効にする [--power-profile により非推奨]
kk: Профильдеу кезінде Орталық процессорды шектеуді сөндіру [--power-profile үшін ескірген]
sr@latin: Onemogući prigušivanje (trotlovanje) procesora tokom profilisanja [zastarelo za --power-profile]

source: Make sysprof specific to a task [Deprecated]
be: Зрабіць sysprof спецыфічным для задачы [Састарэла]
ja: sysprof を特定のタスクに限定する [非推奨]
kk: Sysprof-ты белгілі бір тапсырмаға арналған ету [Ескірген]
sr@latin: Ograniči sysprof na određeni zadatak [zastarelo]

source: Run a command and profile the process
be: Выканаць загад і прафіляваць працэс
ja: コマンドを実行してプロセスをプロファイリングする
kk: Команданы орындау және процесті профильдеу
sr@latin: Izvršava naredbu i profiliše proces

source: COMMAND
be: КАМАНДА
kk: КОМАНДА
sr@latin: NAREDBA

source: Set environment variable for spawned process. Can be used multiple times.
be: Усталюйце зменную асяроддзя для створанага працэсу. Можна быць выкарыстана некалькі разоў.
ja: 起動するプロセスの環境変数を設定します。複数回使用可能です。
kk: Іске қосылған процесс үшін қоршам айнымалысын орнату. Бірнеше рет пайдалануға болады.
sr@latin: Postavlja promenljivu okruženja za izrođene procese. Može se koristiti više puta.

source: VAR=VALUE
be: ЗМЕННАЯ=ЗНАЧЭННЕ
kk: VAR=МӘН
sr@latin: PROM=VREDNOST

source: Force overwrite the capture file
be: Прымусова перазапісаць файл захопу
ja: キャプチャファイルを強制的に上書きする
kk: Түсіру файлын мәжбүрлі түрде қайта жазу
sr@latin: Primorava prepisivanje datoteke snimanja

source: Disable recording of battery statistics
be: Адключыць запіс статыстыкі батарэі
ja: バッテリー統計の記録を無効にする
kk: Батарея статистикасын жазуды сөндіру
sr@latin: Isključuje snimanje statistike baterije

source: Disable recording of CPU statistics
be: Адключыць запіс статыстыкі працэсара
ja: CPU 統計の記録を無効にする
kk: Процессор статистикасын жазуды сөндіру
sr@latin: Isključuje snimanje statistike procesora

source: Disable recording of Disk statistics
be: Адключыць запіс статыстыкі дыска
ja: ディスク統計の記録を無効にする
kk: Диск статистикасын жазуды сөндіру
sr@latin: Isključuje snimanje statistike diska

source: Do not record stacktraces using Linux perf
be: Не запісвайце трасіроўкі стэка з дапамогай Linux perf
ja: Linux perf を使用したスタックトレースを記録しない
kk: Linux perf көмегімен стек іздерін жазбау
sr@latin: Ne snima praćenja spremnika koristeći Linuks „perf“

source: Do not append symbol name information from local machine
be: Не дадавайце інфармацыю аб назве сімвала з лакальнай машыны
ja: ローカルマシンからシンボル名情報を追加しない
kk: Жергілікті машинадан таңба атауы туралы ақпаратты қоспау
sr@latin: Ne dodaje informacije o nazivu simbola iz lokalnog računara

source: Disable recording of memory statistics
be: Адключыць запіс статыстыкі памяці
ja: メモリ統計の記録を無効にする
kk: Жад статистикасын жазуды сөндіру
sr@latin: Isključuje snimanje statistike memorije

source: Disable recording of network statistics
be: Адключыць запіс сеткавай статыстыкі
ja: ネットワーク統計の記録を無効にする
kk: Желі статистикасын жазуды сөндіру
sr@latin: Isključuje snimanje statistike mreže

source: Set SYSPROF_TRACE_FD environment for subprocess
be: Усталюйце асяроддзе SYSPROF_TRACE_FD для падпрацэсу
ja: サブプロセスに SYSPROF_TRACE_FD 環境変数を設定する
kk: Субпроцесс үшін SYSPROF_TRACE_FD қоршамын орнату
sr@latin: Postavlja „SYSPROF_TRACE_FD“ okruženje za podprocese

source: Track when processes are scheduled
be: Адсочвайце, калі працэсы запланаваныя
ja: プロセスのスケジューリングを追跡する
kk: Процестердің жоспарлануын қадағалау
sr@latin: Prati kada su procesi zakazani

source: Profile the D-Bus session bus
be: Аналізаваць шыну сесіі D-Bus
ja: D-Bus セッションバスをプロファイルする
kk: D-Bus сессия шинасын профильдеу
sr@latin: Profil D-magistrale sesije

source: Profile the D-Bus system bus
be: Аналізаваць шыну сістэмы D-Bus
ja: D-Bus システムバスをプロファイルする
kk: D-Bus жүйелік шинасын профильдеу
sr@latin: Profil D-magistrale sistema

source: Set GJS_TRACE_FD environment to trace GJS processes
be: Усталюйце асяроддзе GJS_TRACE_FD для адсочвання працэсаў GJS
ja: GJS プロセス追跡用の GJS_TRACE_FD 環境変数を設定する
kk: GJS процестерін бақылау үшін GJS_TRACE_FD қоршамын орнату
sr@latin: Postavlja „GJS_TRACE_FD“ okruženje za praćenje GJS procesa

source: Set GTK_TRACE_FD environment to trace a GTK application
be: Усталюйце асяроддзе GTK_TRACE_FD для адсочвання прыкладання GTK
ja: GTK アプリケーション追跡用の GTK_TRACE_FD 環境変数を設定する
kk: GTK қолданбасын бақылау үшін GTK_TRACE_FD қоршамын орнату
sr@latin: Postavlja „GJS_TRACE_FD“ okruženje za praćenje GTK programa

source: Include RAPL energy statistics
be: Уключыце статыстыку энергіі RAPL
ja: RAPL エネルギー統計情報を含める
kk: RAPL энергия статистикасын қосу
sr@latin: Zključuje „RAPL“ statistiku napajanja

source: Profile memory allocations and frees
be: Выдзяленне і вызваленне памяці профілю
ja: メモリ割り当てと解放をプロファイルする
kk: Жадтың бөлінуін және босатылуын профильдеу
sr@latin: Profiliše raspodelu memorije i oslobađa

source: Connect to org.gnome.Shell for profiler statistics
be: Падключыцеся да org.gnome.Shell для атрымання статыстыкі прафайлера
ja: org.gnome.Shell に接続してプロファイラー統計を取得する
kk: Профайлер статистикасы үшін org.gnome.Shell-ге қосылу
sr@latin: Povezuje se na „org.gnome.Shell“ za statistike profilatora

source: Track performance of the applications main loop
be: Адсочванне прадукцыйнасці асноўнага цыкла прыкладанняў
ja: アプリケーションのメインループのパフォーマンスを追跡する
kk: Қолданбалардың негізгі циклінің өнімділігін қадағалау
sr@latin: Prati učinkovitost glavne petlje programa

source: Merge all provided *.syscap files and write to stdout
be: Аб'яднаць усе прадстаўленыя файлы *.syscap і запісаць у стандартны вывад
ja: 提供されたすべての *.syscap ファイルをマージして標準出力に書き出す
kk: Барлық берілген *.syscap файлдарын біріктіру және stdout-қа жазу
sr@latin: Stapa sve dostavljene „*.syscap“ datoteke i piše na standardni izlaz

source: Print the sysprof-cli version and exit
be: Раздрукуйце версію sysprof-cli і выйдзіце
ja: sysprof-cli のバージョンを表示して終了する
kk: sysprof-cli нұсқасын басып шығару және шығу
sr@latin: Ispisuje izdanje programa „sysprof-cli“ i izlazi

source: The size of the buffer in pages (1 = 1 page)
be: Памер буфера ў старонках (1 = 1 старонка)
ja: バッファーサイズ (ページ単位、1 = 1 ページ)
kk: Буфердің беттермен өлшенген өлшемі (1 = 1 бет)
sr@latin: Veličina bafera u stranicama (1 = jedna stranica)

source: Additional D-Bus address to monitor
be: Дадатковы адрас D-Bus для кантролю
ja: 監視する追加の D-Bus アドレス
kk: Бақылау үшін қосымша D-Bus адресі
sr@latin: Dodatne adrese D-magistrale za praćenje

source: Stack size to copy for unwinding in user-space
ja: ユーザー空間でのアンワインド用にコピーするスタックサイズ
kk: Пайдаланушы кеңістігінде қалпына келтіру үшін көшірілетін стек өлшемі
sr@latin: Veličina steka za kopiranje radi raspetljavanja u korisničkom prostoru

source: Do not use debuginfod to resolve symbols
ja: シンボル解決に debuginfod を使用しない
kk: Таңбаларды шешу үшін debuginfod қолданбау
sr@latin: Ne koristi debuginfod za razrešenje simbola

source: Do not use Sysprofd to acquire privileges
ja: 権限取得に Sysprofd を使用しない
kk: Артықшылықтарды алу үшін Sysprofd қолданбау
sr@latin: Ne koristi Sysprofd za dobijanje ovlašćenja

source: [CAPTURE_FILE] [-- COMMAND ARGS] — Sysprof
kk: [ТҮСІРУ_ФАЙЛЫ] [--КОМАНДА АРГУМЕНТТЕР] — Sysprof
sr@latin: [DATOTEKA_SNIMKA] [-- NAREDBA ARGUMENTI] – Sysprof

source: Examples: # Record gtk4-widget-factory using trace-fd to get application provided # data as well as GTK and GNOME Shell data providers sysprof-cli --gtk --gnome-shell --use-trace-fd -- gtk4-widget-factory # Merge multiple syscap files into one sysprof-cli --merge a.syscap b.syscap > c.syscap # Unwind by capturing stack/register contents instead of frame-pointers # where the stack-size is a multiple of page-size sysprof-cli --stack-size=8192
ja: 例: # trace-fdを使用してgtk4-widget-factoryを記録し、アプリケーション提供 # データおよびGTKとGNOME Shellのデータプロバイダーを取得 sysprof-cli --gtk --gnome-shell --use-trace-fd -- gtk4-widget-factory # 複数のsyscapファイルを1つにマージ sysprof-cli --merge a.syscap b.syscap > c.syscap # フレームポインターではなくスタック/レジスター内容をキャプチャして # アンワインドを実行（スタックサイズはページサイズの倍数） sysprof-cli --stack-size=8192
kk: Мысалдар: # gtk4-widget-factory қолданбасын қолданба ұсынған деректерді, сондай-ақ # GTK және GNOME Shell деректер жеткізушілерін алу үшін trace-fd арқылы жазу sysprof-cli --gtk --gnome-shell --use-trace-fd -- gtk4-widget-factory # Бірнеше syscap файлдарын біреуге біріктіру sysprof-cli --merge a.syscap b.syscap > c.syscap # Фрейм көрсеткіштерінің орнына стек/регистр мазмұнын түсіру арқылы # стек өлшемі бет өлшеміне еселі болған кезде қалпына келтіру sysprof-cli --stack-size=8192
sr@latin: Primeri: # Snima „gtk4-widget-factory“ koristeći „trace-fd“ da dobije dostavljeni program # podaci kao dostavljači podataka GTK-a i Gnomove školjke sysprof-cli --gtk --gnome-shell --use-trace-fd -- gtk4-widget-factory # Stapa više datoteka snimaka sistema u jednu sysprof-cli --merge a.syscap b.syscap > c.syscap # Raspetljava snimanjem steka/registrovanog sadržaja umesto pokazivača # okvira gde je veličina steka umnožak veličine stranice sysprof-cli --stack-size=8192

source: Too many arguments were passed to sysprof-cli:
be: У sysprof-cli было перададзена занадта шмат аргументаў:
ja: sysprof-cli に渡された引数が多すぎます:
kk: sysprof-cli-ге тым көп аргумент жіберілді:
sr@latin: Previše argumenata je prosleđeno konzolnom programu:

source: %s exists. Use --force to overwrite
be: %s існуе. Выкарыстоўвайце --force для перазапісу
ja: %s が存在します。上書きするには --force を使用してください
kk: %s бар. Қайта жазу үшін --force пайдаланыңыз
sr@latin: „%s“ je izašao. Koristite „--force“ da prepišete

source: Profile the system
be: Прафілюйце сістэму
ja: システムをプロファイルする
kk: Жүйені профильдеу
sr@latin: Profilišite sistem

source: Authentication is required to profile the system.
be: Для прафілявання сістэмы патрабуецца аўтэнтыфікацыя.
ja: システムをプロファイルするには認証が必要です。
kk: Жүйені профильдеу үшін аутентификация қажет.
sr@latin: Potrebno je potvrđivanje identiteta za profilisanje sistema.

# shortcut window
source: Recording View
be: Прагляд запісу
ja: 記録ビュー
kk: Жазу көрінісі
sr@latin: Snimanje pregleda

# shortcut window
source: Start New Recording
be: Пачаць новы запіс
ja: 新しい記録を開始
kk: Жаңа жазуды бастау
sr@latin: Započni novo snimanje

# shortcut window
source: Save As
be: Захаваць як
ja: 名前を付けて保存する
kk: Қалай сақтау
sr@latin: Sačuvaj kao

# shortcut window
source: Toggle Visibility of Main Sidebar
be: Пераключыць бачнасць галоўнай панэлі
ja: メインサイドバーの表示/非表示を切り替え
kk: Негізгі бүйірлік панельдің көрінуін ауыстыру
sr@latin: Promena vidljivosti glavne bočne trake

# shortcut window
source: Toggle Visibility of Stack Trace Sidebar
be: Пераключыць бачнасць панэлі трасіроўкі стэка
ja: スタックトレースサイドバーの表示/非表示を切り替え
kk: Стек ізінің бүйірлік панелінің көрінуін ауыстыру
sr@latin: Promena vidljivosti bočne trake steka

# shortcut window
source: General
be: Агульнае
ja: 全般
kk: Жалпы
sr@latin: Opšte

# shortcut window
source: Open Recording
be: Адкрыйце запіс
ja: 記録を開く
kk: Жазбаны ашу
sr@latin: Otvori snimanje

# shortcut window
source: Close Window
be: Зачыніць акно
ja: ウィンドウを閉じる
kk: Терезені жабу
sr@latin: Zatvara prozor

# shortcut window
source: Show Help
be: Паказаць даведку
ja: ヘルプを表示する
kk: Көмекті көрсету
sr@latin: Prikz pomoći

# shortcut window
source: Show keyboard shortcuts
be: Паказваць спалучэнні клавіш
ja: キーボードショートカットを表示する
kk: Пернетақта жарлықтарын көрсету
sr@latin: Prikaži prečice tastature

# shortcut window
source: Quit
be: Выхад
ja: 終了する
kk: Шығу
sr@latin: Izlazi

source: Make Function Root
ja: 関数をルートにする
kk: Функцияны түбір ету
sr@latin: Napravi koren funkcije

source: Options
be: Параметры
ja: オプション
kk: Опциялар
sr@latin: Opcije

source: Categorize Frames
be: Класіфікаваць кадры
ja: フレームを分類する
kk: Фреймдерді санаттарға бөлу
sr@latin: Kategorizuj okvire

source: Hide System Libraries
be: Схаваць сістэмныя бібліятэкі
ja: システムライブラリを隠す
kk: Жүйелік кітапханаларды жасыру
sr@latin: Sakrij sistemske biblioteke

source: Include Threads
be: Уключыць тэмы
ja: スレッドを含める
kk: Ағындарды қосу
sr@latin: Uključi niti procesora

source: Bottom Up
be: Кнопка ўверх
ja: ボトムアップ
kk: Төменнен жоғары
sr@latin: Odozdo nagore

source: Ignore Kernel Processes
be: Ігнараваць працэсы ядра
ja: カーネルプロセスを無視する
kk: Ядро процестерін елемеу
sr@latin: Zanemari procese jezgra

source: Ignore Process 0
be: Ігнараваць працэс 0
ja: プロセス 0 を無視する
kk: 0-ші процесті елемеу
sr@latin: Zanemari proces 0

source: Merge Similar Processes
be: Аб'яднаць падобныя працэсы
ja: 類似プロセスを統合する
kk: Ұқсас процестерді біріктіру
sr@latin: Spoji slične procese

source: Failed to find property %s in %s
be: Не ўдалося знайсці ўласцівасць %s у %s
ja: %2$s 内にプロパティ %1$s が見つかりません
kk: %s қасиетін %s ішінен табу сәтсіз аяқталды
sr@latin: Ne mogu da nađem osobinu %s u %s

source: Failed to retrieve va_list value: %s
be: Не ўдалося атрымаць значэнне va_list: %s
ja: va_list 値の取得に失敗しました: %s
kk: va_list мәнін алу сәтсіз аяқталды: %s
sr@latin: Ne mogu da prikupim vrednost va_list: %s

source: Start a new recording
ja: 新しい記録を開始
kk: Жаңа жазуды бастау
sr@latin: Započni novo snimanje

source: Show Sysprof version and exit
be: Паказаць версію Sysprof і выйсці
ja: バージョン情報を表示して終了
kk: Sysprof нұсқасын көрсету және шығу
sr@latin: Ispiši Sysprof verziju i izađi

source: A system profiler
be: Сістэмны прафайлер
ja: システムプロファイラー
kk: Жүйелік профильдеуші
sr@latin: Profilator sistema

source: translator-credits
be: vlma@tut.by Uladzimir Manulenka
ja: Japanese Translation Team https://l10n.gnome.org/teams/ja/ Makoto Sakaguchi <ycco34vx@gmail.com>
kk: Baurzhan Muftakhidinov <baurthefirst@gmail.com>
sr@latin: Miroslav Nikolić <miroslavnikolic@rocketmail.com> http://prevod.org — prevodi na srpski jezik

source: Functions
be: Функцыі
ja: 関数
kk: Функциялар
sr@latin: Funkcije

source: Filter Functions
be: Функцыі фільтра
ja: 関数をフィルタ
kk: Функцияларды сүзгілеу
sr@latin: Filter funkcija

source: Callers
be: Абаненты
ja: 呼び出し元
kk: Шақырушылар
sr@latin: Pozivači

source: Descendants
be: Нашчадкі
ja: 呼び出し先
kk: Ұрпақтар
sr@latin: Naslednici

source: Counters Chart
be: Дыяграма лічыльнікаў
ja: カウンターチャート
kk: Есептегіштер диаграммасы
sr@latin: Grafik brojača

source: Counters Table
be: Табліца лічыльнікаў
ja: カウンターテーブル
kk: Есептегіштер кестесі
sr@latin: Tabela brojača

source: Time
be: Час
ja: 時間
kk: Уақыт
sr@latin: Vreme

source: Category
be: Катэгорыя
ja: カテゴリ
kk: Санат
sr@latin: Kategorija

source: Name
be: Назва
ja: 名前
kk: Аты
sr@latin: Naziv

source: Value
be: Каштоўнасць
ja: 値
kk: Мән
sr@latin: Vrednost

source: CPU Info
be: Інфармацыя пра працэсар
ja: CPU 情報
kk: Процессор ақпараты
sr@latin: Podaci o procesoru

source: Core
be: Ядро
ja: コア
kk: Ядро
sr@latin: Jezgro

source: Model Name
be: Назва мадэлі
ja: モデル名
kk: Модель аты
sr@latin: Naziv modela

source: Bus
be: Шына
ja: バス
kk: Шина
sr@latin: Magistrala

source: Serial
be: Серыйны нумар
ja: シリアル
kk: Сериялық нөмір
sr@latin: Serijski broj

source: Reply
be: Адказаць
ja: 応答
kk: Жауап
sr@latin: Odgovor

source: Flags
be: Сцягі
ja: フラグ
kk: Жалаушалар
sr@latin: Zastavice

source: Size
be: Памер
ja: サイズ
kk: Өлшемі
sr@latin: Veličina

source: Type
be: Тып
ja: 種類
kk: Түрі
sr@latin: Vrsta

source: Sender
be: Адпраўшчык
ja: 送信元
kk: Жіберуші
sr@latin: Pošiljalac

source: Destination
be: Пункт прызначэння
ja: 宛先
kk: Мақсаты
sr@latin: Odredište

source: Path
be: Шлях
ja: パス
kk: Жол
sr@latin: Putanja

source: Interface
be: Інтэрфэйс
ja: インターフェース
kk: Интерфейс
sr@latin: Sučelje

source: Member
be: Удзельнік
ja: メンバー
kk: Мүше
sr@latin: Član

source: Signature
be: Подпіс
ja: シグネチャ
kk: Қолтаңба
sr@latin: Potpis

source: Filter Messages
be: Фільтр паведамленняў
ja: メッセージをフィルタ
kk: Хабарламаларды сүзгілеу
sr@latin: Filter poruka

source: Message
be: Паведамленне
ja: メッセージ
kk: Хабарлама
sr@latin: Poruka

source: Files
be: Файлы
ja: ファイル
kk: Файлдар
sr@latin: Datoteke

source: Compressed
be: Сціснуты
ja: 圧縮済み
kk: Сығылған
sr@latin: Zapakovano

source: Filter Files
be: Фільтр файлаў
ja: ファイルをフィルタ
kk: Файлдарларды сүзгілеу
sr@latin: Filter datoteka

source: File
be: Файл
ja: ファイル
kk: Файл
sr@latin: Datoteka

source: Use KEY=VALUE to set an environment variable
be: Выкарыстоўвайце KEY=VALUE, каб усталяваць зменную асяроддзя
ja: 環境変数の設定には、KEY=VALUE形式を使用
kk: Қоршам айнымалысын орнату үшін КІЛТ=МӘНІ пайдаланыңыз
sr@latin: Koristite KLJUČ=VREDNOST da postavite promenljive okruženja

source: Keys may not start with a number
be: Ключы могуць не пачынацца з лічбы
ja: キーは数字で始めることはできません
kk: Кілттер саннан басталмауы керек
sr@latin: Ključevi ne smeju da počinju brojem

source: Keys may only contain alpha-numerics or underline.
be: Ключы могуць утрымліваць толькі літары, лічбы або падкрэсліванне.
ja: キーには英数字またはアンダースコア以外の文字を含めることはできません。
kk: Кілттер тек әріптерді, сандарды немесе астын сызу таңбасын қамтуы мүмкін.
sr@latin: Ključevi mogu da sadrže samo alfa-numeričke znakove ili donju crticu.

source: Must Capture to Local File
be: Патрабуецца захаванне ў лакальны файл
ja: ローカルファイルに取り込む必要があります
kk: Жергілікті файлға түсіру керек
sr@latin: Mora da snimi u lokalnu datoteku
